html/rust/cargo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>包管理器</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="fp.html"> UP </a>
 |
 <a accesskey="H" href="rust.html"> HOME </a>
</div><div id="content">
<h1 class="title">包管理器</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">采用发布配置自定义构建</a></li>
<li><a href="#sec-2">将 crate 发布到 Crates.io</a></li>
</ul>
</div>
</div>
<p>
目前为止只使用过 Cargo 构建、运行和测试代码这些最基本的功能，不过它还可以做到更多。本章会讨论 Cargo 其他一些更为高级的功能：
</p>
<ul class="org-ul">
<li>使用发布配置来自定义构建
</li>
<li>将库发布到 crates.io
</li>
<li>使用工作空间来组织更大的项目
</li>
<li>从 crates.io 安装二进制文件
</li>
<li>使用自定义的命令来扩展 Cargo
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">采用发布配置自定义构建</h2>
<div class="outline-text-2" id="text-1">
<p>
在 Rust 中 <span class="underline">发布配置</span> 是预定义的、可定制的带有不同选项的配置，他们允许程序员更灵活地控制代码编译的多种选项。每一个配置都彼此相互独立。
</p>

<p>
Cargo 有两个主要的配置：
</p>
<ul class="org-ul">
<li>运行 cargo build 时采用的 dev 配置：开发时的好的默认配置，
</li>
<li>运行 cargo build &#x2013;release 的 release 配置：有着良好的发布构建的默认配置
</li>
</ul>

<p>
这些配置名称可能很眼熟，因为它们出现在构建的输出中：
</p>

<div class="org-src-container">

<pre class="src src-sh">$ cargo build
    Finished dev [unoptimized + debuginfo] target(s) <span style="color: #00bfff; font-weight: bold;">in</span> 0.0 secs
$ cargo build --release
    Finished release [optimized] target(s) <span style="color: #00bfff; font-weight: bold;">in</span> 0.0 secs
</pre>
</div>

<pre class="example">
构建输出中的 dev 和 release 表明编译器在使用不同的配置
</pre>

<p>
当项目的 Cargo.toml 文件中没有任何 [profile.*] 部分的时候，Cargo 会对每一个配置都采用默认设置。通过 <b>增加</b> 任何希望定制的配置对应的 <span class="underline">[profile.*]</span> 部分，可以选择覆盖任意默认设置的子集。例如，如下是 dev 和 release 配置的 opt-level 设置的默认值：
</p>

<div class="org-src-container">

<pre class="src src-toml">[<span style="color: #98f5ff;">profile.dev</span>]
<span style="color: #4eee94;">opt-level</span> = 0

[<span style="color: #98f5ff;">profile.release</span>]
<span style="color: #4eee94;">opt-level</span> = 3
</pre>
</div>

<pre class="example">
opt-level 设置控制 Rust 会对代码进行何种程度的优化。这个配置的值从 0 到 3。越高的优化级别需要更多的时间编译

如果在进行开发并经常编译，可能会希望在牺牲一些代码性能的情况下编译得快一些，这就是为什么 dev 的 opt-level 默认为 0

当准备发布时，花费更多时间在编译上则更好。只需要在发布模式编译一次，而编译出来的程序则会运行很多次，所以发布模式用更长的编译时间换取运行更快的代码。这正是为什么 release 配置的 opt-level 默认为 3
</pre>

<p>
可以选择通过在 Cargo.toml 增加不同的值来覆盖任何默认设置。比如，如果想要在开发配置中使用级别 1 的优化，则可以在 Cargo.toml 中增加这两行：
</p>

<div class="org-src-container">

<pre class="src src-toml">[<span style="color: #98f5ff;">profile.dev</span>]
<span style="color: #4eee94;">opt-level</span> = 1
</pre>
</div>

<pre class="example">
  这会覆盖默认的设置 0，现在运行 cargo build 时，Cargo 将会使用 dev 的默认配置加上定制的 opt-level。因为 opt-level 设置为 1，Cargo 会比默认进行更多的优化，但是没有发布构建那么多

  对于每个配置的设置和其默认值的完整列表，请查看 Cargo 的文档
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">将 crate 发布到 Crates.io</h2>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
